In [1]:
#IMPORT LIBRARY
import pandas as pd

In [2]:
#Empty df
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [3]:
city=['Dhaka', 'Barishal', 'Khulna']

In [4]:
city

['Dhaka', 'Barishal', 'Khulna']

In [5]:
df=pd.DataFrame(city)
df

          0
0     Dhaka
1  Barishal
2    Khulna

In [6]:
type(city)

list

In [7]:
row, col=df.shape

In [8]:
row

3

In [9]:
col

1

In [10]:
df.shape

(3, 1)

In [11]:
df=pd.DataFrame(city, columns=['City_in BD'])
df

  City_in BD
0      Dhaka
1   Barishal
2     Khulna

In [12]:
df=pd.DataFrame(city, columns=['City_in BD'], index=['c1', 'c2', 'c3'])
df

   City_in BD
c1      Dhaka
c2   Barishal
c3     Khulna